In [1]:
import numpy as np
import pandas as pd

In [6]:
input = np.loadtxt("input/input_day01.txt")

In [11]:
input

array([[97924., 12015.],
       [50267., 32019.],
       [98415., 10716.],
       ...,
       [17846., 56504.],
       [61807., 42097.],
       [93272., 97487.]])

In [ ]:
input[0]

array([97924., 12015.])

In [16]:
list1 = sorted(input[:,0])
list2 = sorted(input[:,1])

In [21]:
df = pd.DataFrame({
    'list1': list1,   
    'list2': list2 
})

In [23]:
df["difference"] = abs(df["list1"] - df["list2"])

In [28]:
df

       list1    list2  difference
0    10024.0  10028.0         4.0
1    10208.0  10043.0       165.0
2    10261.0  10112.0       149.0
3    10294.0  10162.0       132.0
4    10638.0  10314.0       324.0
..       ...      ...         ...
995  99794.0  99284.0       510.0
996  99900.0  99284.0       616.0
997  99904.0  99307.0       597.0
998  99933.0  99374.0       559.0
999  99974.0  99864.0       110.0

[1000 rows x 3 columns]

In [ ]:
# answer 1
sum(df["difference"])

2000468.0

In [64]:
# assignment 2

df_count = df[["list2", "list1"]].groupby("list2").count().rename(columns={"list1" : "count"})

In [66]:
df_count

         count
list2
10028.0      1
10043.0      1
10112.0      1
10162.0      1
10314.0      1
...        ...
99280.0      1
99284.0     20
99307.0      1
99374.0      1
99864.0      1

[662 rows x 1 columns]

In [57]:
df2 = pd.merge(df, df_count, left_on="list1", right_on="list2", how="left")

In [58]:
df2

       list1    list2  difference  count
0    10024.0  10028.0         4.0    NaN
1    10208.0  10043.0       165.0    NaN
2    10261.0  10112.0       149.0    NaN
3    10294.0  10162.0       132.0    NaN
4    10638.0  10314.0       324.0    NaN
..       ...      ...         ...    ...
995  99794.0  99284.0       510.0    NaN
996  99900.0  99284.0       616.0    NaN
997  99904.0  99307.0       597.0    NaN
998  99933.0  99374.0       559.0    NaN
999  99974.0  99864.0       110.0    NaN

[1000 rows x 4 columns]

In [73]:
df2["similarity_score"] = df2["list1"] * df2["count"]

In [74]:
df2["similarity_score"].sum()

18567089.0